HirokiIshiguro/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/main.c
/*
Amazon FreeRTOS
Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
the Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 http://aws.amazon.com/freertos
 http://www.FreeRTOS.org
*/

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"

/* System init includes. */
#include "iot_system_init.h"

/* Logging includes. */
#include "iot_logging_task.h"

/* Key provisioning includes. */
#include "aws_dev_mode_key_provisioning.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include <stdio.h>
#include <string.h>

/* Demo includes */
#include "aws_demo.h"
#include "aws_clientcredential.h"

/* RX72N Envision Kit system header include */
#include "rx72n_envision_kit_system.h"

#define mainLOGGING_TASK_STACK_SIZE         ( configMINIMAL_STACK_SIZE * 6 )
#define mainLOGGING_MESSAGE_QUEUE_LENGTH    ( 15 )
#define mainTEST_RUNNER_TASK_STACK_SIZE    ( configMINIMAL_STACK_SIZE * 8 )

extern void main_task(void);
extern void main_task_init(void);

/* The MAC address array is not declared const as the MAC address will
normally be read from an EEPROM and not hard coded (in real deployed
applications).*/
static uint8_t ucMACAddress[ 6 ] =
{
    configMAC_ADDR0,
    configMAC_ADDR1,
    configMAC_ADDR2,
    configMAC_ADDR3,
    configMAC_ADDR4,
    configMAC_ADDR5
}; //XXX

uint8_t g_ucNetworkInterfaceMACAddress[ 6 ] =
{
    configMAC_ADDR0,
    configMAC_ADDR1,
    configMAC_ADDR2,
    configMAC_ADDR3,
    configMAC_ADDR4,
    configMAC_ADDR5
};

/* Define the network addressing.  These parameters will be used if either
ipconfigUDE_DHCP is 0 or if ipconfigUSE_DHCP is 1 but DHCP auto configuration
failed. */
static const uint8_t ucIPAddress[ 4 ] =
{
    configIP_ADDR0,
    configIP_ADDR1,
    configIP_ADDR2,
    configIP_ADDR3
};
static const uint8_t ucNetMask[ 4 ] =
{
    configNET_MASK0,
    configNET_MASK1,
    configNET_MASK2,
    configNET_MASK3
};
static const uint8_t ucGatewayAddress[ 4 ] =
{
    configGATEWAY_ADDR0,
    configGATEWAY_ADDR1,
    configGATEWAY_ADDR2,
    configGATEWAY_ADDR3
};

/* The following is the address of an OpenDNS server. */
static const uint8_t ucDNSServerAddress[ 4 ] =
{
    configDNS_SERVER_ADDR0,
    configDNS_SERVER_ADDR1,
    configDNS_SERVER_ADDR2,
    configDNS_SERVER_ADDR3
};

/**
 * @brief Application task startup hook.
 */
void vApplicationDaemonTaskStartupHook( void );

/**
 * @brief Initializes the board.
 */
static void prvMiscInitialization( void );
static BaseType_t prvParseMacAddressString( const char * pcMacAddressString,
                                            uint8_t ucParsedMacAddress[ 6 ] );
static void prvLoadMacAddressFromDataFlash( void );
static void prvPublishMacAddressToNetworkInterface( void );
/*-----------------------------------------------------------*/

/**
 * @brief The application entry point from a power on reset is PowerON_Reset_PC()
 * in resetprg.c.
 */
void main( void )
{
    while(1)
    {
    	main_task();
    }
}
/*-----------------------------------------------------------*/

static void prvMiscInitialization( void )
{
    /* Initialize UART for serial terminal. */
    uart_config();

    /* enable MCU pins */
    R_Pins_Create();

    /* system timer initialization */
    R_SYS_TIME_Open();

    /* Start logging task. */
    xLoggingTaskInitialize( mainLOGGING_TASK_STACK_SIZE,
                            tskIDLE_PRIORITY,
                            mainLOGGING_MESSAGE_QUEUE_LENGTH );

    /* Initialize the SFD cache once at startup. Keep flash driver lifecycle
     * under the callers that actually perform erase/write work. */
    R_SFD_Open();

    /* flash access semaphore creation */
    xSemaphoreCodeFlashAccess = xSemaphoreCreateBinary();
    xSemaphoreGive(xSemaphoreCodeFlashAccess);
}
/*-----------------------------------------------------------*/

static BaseType_t prvParseMacAddressString( const char * pcMacAddressString,
                                            uint8_t ucParsedMacAddress[ 6 ] )
{
    unsigned int ulOctets[ 6 ] = { 0 };
    int lParsedCount = 0;
    size_t xIndex = 0;

    if( pcMacAddressString == NULL )
    {
        return pdFALSE;
    }

    lParsedCount = sscanf( pcMacAddressString,
                           "%2x:%2x:%2x:%2x:%2x:%2x",
                           &ulOctets[ 0 ],
                           &ulOctets[ 1 ],
                           &ulOctets[ 2 ],
                           &ulOctets[ 3 ],
                           &ulOctets[ 4 ],
                           &ulOctets[ 5 ] );

    if( lParsedCount != 6 )
    {
        lParsedCount = sscanf( pcMacAddressString,
                               "%2x-%2x-%2x-%2x-%2x-%2x",
                               &ulOctets[ 0 ],
                               &ulOctets[ 1 ],
                               &ulOctets[ 2 ],
                               &ulOctets[ 3 ],
                               &ulOctets[ 4 ],
                               &ulOctets[ 5 ] );
    }

    if( lParsedCount != 6 )
    {
        return pdFALSE;
    }

    for( xIndex = 0; xIndex < 6; xIndex++ )
    {
        ucParsedMacAddress[ xIndex ] = ( uint8_t ) ulOctets[ xIndex ];
    }

    return pdTRUE;
}
/*-----------------------------------------------------------*/

static void prvLoadMacAddressFromDataFlash( void )
{
    SFD_HANDLE xMacAddressHandle = SFD_HANDLE_INVALID;
    uint8_t * pucMacAddressString = NULL;
    uint32_t ulMacAddressLength = 0;

    xMacAddressHandle = R_SFD_FindObject( ( uint8_t * ) mac_address_label,
                                          ( uint8_t ) strlen( mac_address_label ) );

    if( xMacAddressHandle == SFD_HANDLE_INVALID )
    {
        configPRINTF( ( "MAC address not found in dataflash. Using built-in default.\r\n" ) );
        return;
    }

    if( R_SFD_GetObjectValue( xMacAddressHandle,
                              &pucMacAddressString,
                              &ulMacAddressLength ) != SFD_SUCCESS )
    {
        configPRINTF( ( "Failed to read MAC address from dataflash. Using built-in default.\r\n" ) );
        return;
    }

    if( ( pucMacAddressString == NULL ) || ( ulMacAddressLength == 0 ) )
    {
        configPRINTF( ( "MAC address entry in dataflash is empty. Using built-in default.\r\n" ) );
        return;
    }

    if( prvParseMacAddressString( ( const char * ) pucMacAddressString, ucMACAddress ) != pdTRUE )
    {
        configPRINTF( ( "Invalid MAC address in dataflash: %s\r\n", pucMacAddressString ) );
        configPRINTF( ( "Using built-in default MAC address instead.\r\n" ) );
        return;
    }

    configPRINTF( ( "Loaded MAC address from dataflash: %02X:%02X:%02X:%02X:%02X:%02X\r\n",
                    ucMACAddress[ 0 ],
                    ucMACAddress[ 1 ],
                    ucMACAddress[ 2 ],
                    ucMACAddress[ 3 ],
                    ucMACAddress[ 4 ],
                    ucMACAddress[ 5 ] ) );
}
/*-----------------------------------------------------------*/

static void prvPublishMacAddressToNetworkInterface( void )
{
    ( void ) memcpy( g_ucNetworkInterfaceMACAddress, ucMACAddress, sizeof( ucMACAddress ) );
}
/*-----------------------------------------------------------*/

void vApplicationDaemonTaskStartupHook( void )
{
    uart_string_printf_immediate( "diag: hook entry\r\n" );
    prvMiscInitialization();
    uart_string_printf_immediate( "diag: misc init ok\r\n" );

    if( SYSTEM_Init() == pdPASS )
    {
        uart_string_printf_immediate( "diag: system init ok\r\n" );
        prvLoadMacAddressFromDataFlash();
        prvPublishMacAddressToNetworkInterface();
        uart_string_printf_immediate( "diag: before FreeRTOS_IPInit\r\n" );

        /* Initialise the RTOS's TCP/IP stack.  The tasks that use the network
        are created in the vApplicationIPNetworkEventHook() hook function
        below.  The hook function is called when the network connects. */
        FreeRTOS_IPInit( ucIPAddress,
                         ucNetMask,
                         ucGatewayAddress,
                         ucDNSServerAddress,
                         ucMACAddress );
        uart_string_printf_immediate( "diag: after FreeRTOS_IPInit\r\n" );

        main_task_init();
        uart_string_printf_immediate( "diag: main_task_init ok\r\n" );
    }
    else
    {
        uart_string_printf_immediate( "diag: SYSTEM_Init failed\r\n" );
    }
}

/*-----------------------------------------------------------*/
